app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
      <h5 class="fw-bolder">Email:</h5>
      <p><%= User.find(@post.user_id).email%></p>