app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "author", "text", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    # @post = Post.new(post_params)
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "Rangers - Most Successfull Fottball Club"], ["updated_at", "2022-05-11 05:16:43.275296"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 6], ["LIMIT", 1]]
---
  def correct_user
    @post = current_user.posts.find_by(id: params[:id])